In [1]:
import sqlite3
conn=sqlite3.connect('pythonDB.db')
print("Opened database Successfully")

Opened database Successfully

In [2]:
conn.execute('''CREATE TABLE Company2
             (ID INT PRIMARY KEY,
             NAME TEXT NOT NULL,
             AGE INT NOT NULL,
             ADDRESS CHAR(50),
             SALARY REAL);''')
print("Table Created Successfully")

Table Created Successfully

In [5]:
conn.execute("INSERT INTO Company2 VALUES (1,'Srini',25,'Chennai',20000)");
conn.execute("INSERT INTO Company2 VALUES (2,'Ganesh',30,'UAS',50000)");
conn.execute("INSERT INTO Company2 VALUES (3,'Uma',30,'Chennai',25000)");
conn.execute("INSERT INTO Company2 VALUES (4,'Arun',30,'Chennai',30000)");
conn.commit()
print("Records created successfully");
conn.close()

Records created successfully

In [7]:
class Company:
    def __init__(self,id,name,age,address,salary):
        self.ID=id
        self.Name=name
        self.Age=age
        self.Address=address
        self.Salary=salary
comp1=Company(5,"Chithra",21,"Chennai",15000)
comp2=Company(6,"Pranav",2,"USA",5000)
array=[comp1,comp2]
def insertIntoDB(arr):
    conn=sqlite3.connect('pythonDB.db')
    for  i in arr:
        conn.execute("INSERT INTO Company2 VALUES ("+str(i.ID)+",'"+i.Name+"',"+str(i.Age)+",'"+i.Address+"',"+str(i.Salary)+")");
        #conn.execute("INSERT INTO Company2 VALUES (?,?,?,?,?)",(i.ID,i.Name,i.Age,i.Address,i.Salary));
    conn.commit()
    conn.close()
insertIntoDB(array)

In [4]:
conn=sqlite3.connect('pythonDB.db')
conn.execute("UPDATE Company2 SET Salary = 21000 WHERE ID=1")
conn.execute("DELETE FROM Company2 WHERE ID=4")
data=conn.execute("SELECT * FROM Company2")
for i in data:
    print(i)
conn.commit()
conn.close()

(1, 'Srini', 25, 'Chennai', 21000.0)
(2, 'Ganesh', 30, 'UAS', 50000.0)
(3, 'Uma', 30, 'Chennai', 25000.0)
(5, 'Chithra', 21, 'Chennai', 15000.0)
(6, 'Pranav', 2, 'USA', 5000.0)